Chapter 3 Exercises

Exercise 1. We want to look at data for the Facebook, Apple, Amazon, Netflix, and Google (FAANG) stocks, but we were given each as a separate CSV file. Combine them into a single file and store the dataframe of the FAANG data as faang for the rest of the exercises.

1. Read each file in.

In [83]:
import pandas as pd
import os
os.getcwd() #current working directory

'/home/carey/git/bookclub/Club-08-Data_Analysis_with_Pandas/Hands-On-Data-Analysis-with-Pandas/ch_03/exercises'

In [84]:
aapl = pd.read_csv('aapl.csv')
amzn = pd.read_csv('amzn.csv')
fb  = pd.read_csv('fb.csv')
goog = pd.read_csv('goog.csv')
nflx = pd.read_csv('nflx.csv')

2. Add a column to each dataframe, called ticker , indicating the ticker symbol it is for (Apple's is AAPL, for example). This is how you look up a stock. Each file's name is also the ticker symbol, so be sure to capitalize it.

In [85]:
aapl = aapl.assign(ticker = 'APPL')
amzn = amzn.assign(ticker = 'AMZN')
fb = fb.assign(ticker = 'FB')
goog = goog.assign(ticker = 'GOOG')
nflx = nflx.assign(ticker = 'NFLX')
appl.head()

         date      open      high       low     close    volume ticker
0  2018-01-02  166.9271  169.0264  166.0442  168.9872  25555934   APPL
1  2018-01-03  169.2521  171.2337  168.6929  168.9578  29517899   APPL
2  2018-01-04  169.2619  170.1742  168.8106  169.7426  22434597   APPL
3  2018-01-05  170.1448  172.0381  169.7622  171.6751  23660018   APPL
4  2018-01-08  171.0375  172.2736  170.6255  171.0375  20567766   APPL

3. Append them together into a single dataframe.

In [86]:
faang = pd.concat([aapl, amzn, fb, goog, nflx], ignore_index = True)

In [87]:
faang.head()

         date      open      high       low     close    volume ticker
0  2018-01-02  166.9271  169.0264  166.0442  168.9872  25555934   APPL
1  2018-01-03  169.2521  171.2337  168.6929  168.9578  29517899   APPL
2  2018-01-04  169.2619  170.1742  168.8106  169.7426  22434597   APPL
3  2018-01-05  170.1448  172.0381  169.7622  171.6751  23660018   APPL
4  2018-01-08  171.0375  172.2736  170.6255  171.0375  20567766   APPL

4. Save the result in a CSV file called faang.csv.

In [88]:
faang.to_csv('faang.csv', index = False)

Exercise 2. With faang, use type conversion to change the date column into a datetime and the volume column into integers. Then, sort by date and ticker.

In [92]:
faang.dtypes

date      datetime64[ns]
open             float64
high             float64
low              float64
close            float64
volume             int64
ticker            object
dtype: object

In [99]:
faang.date = pd.to_datetime(faang.date)
faang.volume = faang.volume.astype('int')

In [100]:
faang.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1255 entries, 0 to 1254
Data columns (total 7 columns):
date      1255 non-null datetime64[ns]
open      1255 non-null float64
high      1255 non-null float64
low       1255 non-null float64
close     1255 non-null float64
volume    1255 non-null int64
ticker    1255 non-null object
dtypes: datetime64[ns](1), float64(4), int64(1), object(1)
memory usage: 68.7+ KB

In [103]:
faang = faang.sort_values(by = ['date', 'ticker'])

In [105]:
faang.head()

           date       open       high        low      close    volume ticker
251  2018-01-02  1172.0000  1190.0000  1170.5100  1189.0100   2694494   AMZN
0    2018-01-02   166.9271   169.0264   166.0442   168.9872  25555934   APPL
502  2018-01-02   177.6800   181.5800   177.5500   181.4200  18151903     FB
753  2018-01-02  1048.3400  1066.9400  1045.2300  1065.0000   1237564   GOOG
1004 2018-01-02   196.1000   201.6500   195.4200   201.0700  10966889   NFLX

3. Find the seven rows with the highest value for volume.

In [110]:
faang.nlargest(n=7, columns = 'volume')

          date      open      high       low     close     volume ticker
644 2018-07-26  174.8900  180.1300  173.7500  176.2600  169803668     FB
555 2018-03-20  167.4700  170.2000  161.9500  168.1500  129851768     FB
559 2018-03-26  160.8200  161.1000  149.0200  160.0600  126116634     FB
556 2018-03-21  164.8000  173.4000  163.3000  169.3900  106598834     FB
182 2018-09-21  219.0727  219.6482  215.6097  215.9768   96246748   APPL
245 2018-12-21  156.1901  157.4845  148.9909  150.0862   95744384   APPL
212 2018-11-02  207.9295  211.9978  203.8414  205.8755   91328654   APPL

4. Right now, the data is somewhere between long and wide format. Use melt() to make it completely long format. Hint: date and ticker are our ID variables (they uniquely identify each row). We need to melt the rest so that we don't have separate columns for open , high , low , close , and volume.

In [119]:
faang.head()

           date       open       high        low      close    volume ticker
251  2018-01-02  1172.0000  1190.0000  1170.5100  1189.0100   2694494   AMZN
0    2018-01-02   166.9271   169.0264   166.0442   168.9872  25555934   APPL
502  2018-01-02   177.6800   181.5800   177.5500   181.4200  18151903     FB
753  2018-01-02  1048.3400  1066.9400  1045.2300  1065.0000   1237564   GOOG
1004 2018-01-02   196.1000   201.6500   195.4200   201.0700  10966889   NFLX

In [116]:
faang.shape

(1255, 7)

In [121]:
faang_long = pd.melt(
    faang,
    id_vars = ['date', 'ticker'],
    value_vars = ['open', 'high', 'low', 'close', 'volume'],
    var_name = 'variable',
    value_name = 'value'
)
faang_long.head()

        date ticker variable      value
0 2018-01-02   AMZN     open  1172.0000
1 2018-01-02   APPL     open   166.9271
2 2018-01-02     FB     open   177.6800
3 2018-01-02   GOOG     open  1048.3400
4 2018-01-02   NFLX     open   196.1000

In [122]:
faang_long.shape

(6275, 4)